#### PipePlumbingFixtureFlowData Members

---

|  |
| --- |
| PipePlumbingFixtureFlowData Class   Methods   Properties   See Also |

The  PipePlumbingFixtureFlowData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  PipePlumbingFixtureFlowData |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | DimensionFlow | The dimension flow which is used to calculate flow of the pipe. Units: (gal/min). |
| Public property | FixtureUnits | The fixture units of the pipe. |
| Public property | Flow | The actual flow of the plumbing fixture converted from dimension flow or fixture unit. Units: (gal/min). |
| Public property | FlowConfiguration | The flow configuration mode of the pipe. |
| Public property | FlowConversionMode | The flow conversion mode of the pipe. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

PipePlumbingFixtureFlowData Class

Autodesk.Revit.DB.Plumbing Namespace